=begin

  テストプレイをスムーズに行うため、画面切り替えのフェードを取るセクションです
  
=end
#==============================================================================
# ■ Scene_Title
#------------------------------------------------------------------------------
# 　タイトル画面の処理を行うクラスです。
#==============================================================================
class Scene_Title < Scene_Base
  #--------------------------------------------------------------------------
  # ● トランジション速度の取得
  #--------------------------------------------------------------------------
  def transition_speed
    return 1
  end
  #--------------------------------------------------------------------------
  # ● コマンド［ニューゲーム］
  #--------------------------------------------------------------------------
  def command_new_game
    DataManager.setup_new_game
    close_command_window
    fadeout_all(1)
    $game_map.autoplay
    SceneManager.goto(Scene_Map)
  end
end  

#==============================================================================
# ■ Scene_Map
#------------------------------------------------------------------------------
# 　マップ画面の処理を行うクラスです。
#==============================================================================

class Scene_Map < Scene_Base
  #--------------------------------------------------------------------------
  # ● トランジション実行
  #    戦闘後やロード直後など、画面が暗転しているときはフェードインを行う。
  #--------------------------------------------------------------------------
  def perform_transition
    if Graphics.brightness == 0
      Graphics.transition(0)
      fadein(1)
    else
      super
    end
  end
  #--------------------------------------------------------------------------
  # ● トランジション速度の取得
  #--------------------------------------------------------------------------
  def transition_speed
    return 20
  end
  #--------------------------------------------------------------------------
  # ● 戦闘前トランジション実行
  #--------------------------------------------------------------------------
  #Comentareado para restaurar las transiciones de batalla
  #def perform_battle_transition
    #Graphics.transition(2, "Graphics/System/BattleStart", 100)
    #Graphics.freeze
  #end
end